Tekla.Structures.Model.UI.ViewHandler
The ViewHandler class contains methods for handling views.
using Tekla.Structures.Model.UI;
public class Example
{
public void Example1()
{
ViewHandler.SetRepresentation("standard");
ModelViewEnumerator ViewEnum = ViewHandler.GetAllViews();
while (ViewEnum.MoveNext())
{
View ViewSel = ViewEnum.Current;
ViewHandler.ShowView(ViewSel);
ViewHandler.RedrawView(ViewSel);
ViewHandler.HideView(ViewSel);
}
}
}

Tekla.Structures.Model.UI.ViewHandler.GetAllViews
Fetches all the views from the model.
Returns: A model view enumerator with all the views.

Tekla.Structures.Model.UI.ViewHandler.GetVisibleViews
Returns the visible views.
Returns: A model view enumerator with the visible views.

Tekla.Structures.Model.UI.ViewHandler.GetPermanentViews
Returns the permanent views.
Returns: A model view enumerator with the permanent views.

Tekla.Structures.Model.UI.ViewHandler.GetTemporaryViews
Returns the temporary views.
Returns: A model view enumerator with the temporary views.

Tekla.Structures.Model.UI.ViewHandler.GetSelectedViews
Returns the views the user has selected.
Returns: A model view enumerator with the selected views.

Tekla.Structures.Model.UI.ViewHandler.ShowView(Tekla.Structures.Model.UI.View)
Opens a model view.
view: The view that is to be shown.
Returns: True on success.

Tekla.Structures.Model.UI.ViewHandler.HideView(Tekla.Structures.Model.UI.View)
Closes a model view.
view: The view that is to be closed.
Returns: True on success.

Tekla.Structures.Model.UI.ViewHandler.RedrawView(Tekla.Structures.Model.UI.View)
Redraws a model view.
view: The view that is to be redrawn.
Returns: True on success.

Tekla.Structures.Model.UI.ViewHandler.ZoomToBoundingBox(Tekla.Structures.Model.UI.View,Tekla.Structures.Geometry3d.AABB)
Zooms a model view.
view: The view that is to be zoomed.
B: The bounding box the view is zoomed to.
Returns: True on success.

Tekla.Structures.Model.UI.ViewHandler.ZoomToBoundingBox(Tekla.Structures.Geometry3d.AABB)
Zooms the current model view.
box: The bounding box the current view is zoomed to.
Returns: True on success.
In the following example a part is picked and all the visible views are zoomed
using the part's bounding box as a parameter.
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Picker MyPicker = new Picker();
Part PickPart = MyPicker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART) as Part;
AABB PartBoundingBox = new AABB();
if (PickPart != null)
{
Solid PartSolid = PickPart.GetSolid();
PartBoundingBox.MaxPoint = PartSolid.MaximumPoint;
PartBoundingBox.MinPoint = PartSolid.MinimumPoint;
}
ModelViewEnumerator ViewEnum = ViewHandler.GetVisibleViews();
while (ViewEnum.MoveNext())
{
View ViewSel = ViewEnum.Current;
ViewHandler.ZoomToBoundingBox(ViewSel, PartBoundingBox);
}
}
}

Tekla.Structures.Model.UI.ViewHandler.SetRepresentation(System.String)
Sets the object representation.
Representation: The representation that is to be used. 257 characters at most.
Returns: True on success.

Tekla.Structures.Model.UI.ViewHandler.RedrawWorkplane
Sets the workplane to current transformation plane and redraws it.
Returns: True on success.

Tekla.Structures.Model.UI.ViewHandler.GetActiveView
Get the current active MDI child window view
Returns: currently active view

Tekla.Structures.Model.UI.ViewHandler.SetActiveView(Tekla.Structures.Model.UI.View)
Set the current active MDI child window view.
Returns: The view to set as active.